In [1]:
##################################################################################
#         U B E R   Y   O T R O S   S E R V I C I O S                            #
##################################################################################

In [2]:
# Carga de librerias
import pandas as pd
from datetime import datetime, timedelta

In [12]:
# 2. Carga de datos de viajes de abril.
df_travels_abril = pd.read_csv('https://raw.githubusercontent.com/DayeMorga28/Proyecto_Uber_Phyton/main/uber-raw-data-apr14.csv')

In [13]:
df_travels_abril.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [11]:
df_travels_abril.dtypes

<!DOCTYPE html>    object
dtype: object

In [ ]:
# Renombrando columnas
column_name_mapping = {
    'Date/Time': 'Fecha',
    'Lat': 'Latitud',
    'Lon': 'Longitud',
    'Base': 'id_base'
}

In [ ]:
df_travels_abril_renamed = df_travels_abril.rename(columns=column_name_mapping)
df_travels_abril_renamed

                     Fecha  Latitud  Longitud id_base
0         4/1/2014 0:11:00  40.7690  -73.9549  B02512
1         4/1/2014 0:17:00  40.7267  -74.0345  B02512
2         4/1/2014 0:21:00  40.7316  -73.9873  B02512
3         4/1/2014 0:28:00  40.7588  -73.9776  B02512
4         4/1/2014 0:33:00  40.7594  -73.9722  B02512
...                    ...      ...       ...     ...
564511  4/30/2014 23:22:00  40.7640  -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629  -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443  -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756  -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880  -73.9608  B02764

[564516 rows x 4 columns]

In [ ]:
df_travels_abril_renamed.dtypes

Fecha        object
Latitud     float64
Longitud    float64
id_base      object
dtype: object

In [ ]:
# Cambio el tipo de dato de caracter a datetime
df_travels_abril_renamed['Fecha'] = pd.to_datetime(df_travels_abril_renamed['Fecha'])

In [ ]:
df_travels_abril_renamed.head()

                Fecha  Latitud  Longitud id_base
0 2014-04-01 00:11:00  40.7690  -73.9549  B02512
1 2014-04-01 00:17:00  40.7267  -74.0345  B02512
2 2014-04-01 00:21:00  40.7316  -73.9873  B02512
3 2014-04-01 00:28:00  40.7588  -73.9776  B02512
4 2014-04-01 00:33:00  40.7594  -73.9722  B02512

In [ ]:
def nombre_dia_semana(valor):
    
    ndia = valor.weekday()
    if ndia == 1: return 'Lunes'
    elif ndia == 2: return 'Martes'
    elif ndia == 3: return 'Miercoles'
    elif ndia == 4: return 'Jueves'
    elif ndia == 5: return 'Viernes'
    elif ndia == 6: return 'Sabado'
    else: return 'Domingo'

In [ ]:
# Se agrega el campo DiaSemana
df_travels_abril_renamed['DiaSemana'] = df_travels_abril_renamed['Fecha'].apply(nombre_dia_semana)

In [ ]:
def get_year(valor):
    return valor.year

In [ ]:
# Se agrega el campo Anio
df_travels_abril_renamed['Anio'] = df_travels_abril_renamed['Fecha'].apply(get_year)

In [ ]:
def get_month(valor):
    return valor.month

In [ ]:
# Se agrega el campo Mes
df_travels_abril_renamed['Mes'] = df_travels_abril_renamed['Fecha'].apply(get_month)

In [ ]:
def get_day(valor):
    return valor.day

In [ ]:
# Se agrega el campo Dia
df_travels_abril_renamed['Dia'] = df_travels_abril_renamed['Fecha'].apply(get_day)

In [ ]:
def get_hour(valor):
    return valor.hour

In [ ]:
# Se agrega el campo Hora
df_travels_abril_renamed['Hora'] = df_travels_abril_renamed['Fecha'].apply(get_hour)

In [ ]:
def get_minute(valor):
    return valor.minute

In [ ]:
# Se agrega el campo Minuto
df_travels_abril_renamed['Minuto'] = df_travels_abril_renamed['Fecha'].apply(get_minute)

In [ ]:
df_travels_abril_renamed.head()

,Fecha,Latitud,Longitud,id_base,DiaSemana,Anio,Mes,Dia,Hora,Minuto
0,2014-04-01 00:11:00,40.7690,-73.9549,B02512,Lunes,2014,4,1,0,11
1,2014-04-01 00:17:00,40.7267,-74.0345,B02512,Lunes,2014,4,1,0,17
2,2014-04-01 00:21:00,40.7316,-73.9873,B02512,Lunes,2014,4,1,0,21
3,2014-04-01 00:28:00,40.7588,-73.9776,B02512,Lunes,2014,4,1,0,28
4,2014-04-01 00:33:00,40.7594,-73.9722,B02512,Lunes,2014,4,1,0,33

In [ ]:
df_travels_abril_renamed.isna().sum()

Fecha        0
Latitud      0
Longitud     0
id_base      0
DiaSemana    0
Anio         0
Mes          0
Dia          0
Hora         0
Minuto       0
dtype: int64

In [ ]:
df_travels_abril_sum_bases = df_travels_abril_renamed.groupby('id_base').size()
df_travels_abril_sum_bases.sort_values(ascending=False)

id_base
B02682    227808
B02598    183263
B02617    108001
B02512     35536
B02764      9908
dtype: int64

In [ ]:
df_travels_abril_sum_hora = df_travels_abril_renamed.groupby('Hora').size()
df_travels_abril_sum_hora.sort_values(ascending=False)

Hora
17    45475
18    43003
16    42003
19    38923
21    36964
20    36244
15    35324
22    30645
14    27190
7     24924
8     22843
13    22603
23    20649
12    19425
11    18774
6     18498
9     17939
10    17865
0     11910
5      9476
1      7769
4      6095
3      5040
2      4935
dtype: int64